tutorials/tiltedCube/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Re = U*L/nu = 1 * 0.52 / 0.01 ~ 52 -> laminar, steady-ish wake. Stable for icoFoam.
nu              [0 2 -1 0 0 0 0] 0.01;

// ************************************************************************* //
