tutorials/tiltedCube/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 4;

// scotch produces irregular cuts that slice through the refined/layered region
// around the tilted cube -> multiple processor patches per rank, exercising the
// distributed processor-boundary code paths.
method  scotch;

// ************************************************************************* //
